---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroModule.GetBasicIEnumerator
source: html/7bf5bbe7-6455-1e79-ea3e-1c8aa6219036.htm
---
# Autodesk.Revit.DB.Macros.MacroModule.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.